In [16]:
import pandas as pd
import numpy as np
#import matplotlib.pyplot as plt

In [17]:
# Lire la base de données
data = pd.read_csv('el_massar.csv')

In [18]:
data.head()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time;
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00;
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00;
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00;
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00;
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00;

In [19]:
data

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time;
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00;
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00;
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00;
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00;
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00;
...,...,...,...,...,...,...
18236,18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00;
18237,18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00;
18238,18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45;
18239,18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45;
18240,18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59;

In [20]:
#
data.shape

(18241, 6)

In [21]:
#Type de données
data.dtypes

Unnamed: 0         object
City               object
Colors Reported    object
Shape Reported     object
State              object
Time;              object
dtype: object

In [22]:
#Statistiques
data.describe()

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time;
count,18241,18181,2877,15565,18206,18206
unique,18241,6441,27,27,52,16116
top,4186,Seattle,RED,LIGHT,CA,11/16/1999 19:00;
freq,1,187,779,2795,2521,27

In [23]:
#Repérage des valeurs manquantes
data.isna().sum()

Unnamed: 0             0
City                  60
Colors Reported    15364
Shape Reported      2676
State                 35
Time;                 35
dtype: int64

In [24]:
#Repérage des valeurs dupliquées
data.duplicated().sum()

0

In [25]:
#Supprimer la colonne unnamed
del data['Unnamed: 0']

In [26]:
#Compter les valeurs nulles dans chaque colonne
data.isna().sum()

City                  60
Colors Reported    15364
Shape Reported      2676
State                 35
Time;                 35
dtype: int64

In [27]:
data.head()

                   City Colors Reported Shape Reported State             Time;
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00;
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00;
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00;
3               Abilene             NaN           DISK    KS   6/1/1931 13:00;
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00;

In [28]:
data['Colors Reported'].isna().describe()

count     18241
unique        2
top        True
freq      15364
Name: Colors Reported, dtype: object

In [29]:
#Recherche de pourcentage des valeurs manquante sur la colonne Colors Reported
15364*100/18241

84.22783838605339

In [30]:
#Les valeurs manquantes étant au dessus de 50%, nous procederons à la suppression de la colonne
del data['Colors Reported']

In [31]:
data

                       City Shape Reported State              Time;
0                    Ithaca       TRIANGLE    NY    6/1/1930 22:00;
1               Willingboro          OTHER    NJ   6/30/1930 20:00;
2                   Holyoke           OVAL    CO   2/15/1931 14:00;
3                   Abilene           DISK    KS    6/1/1931 13:00;
4      New York Worlds Fair          LIGHT    NY   4/18/1933 19:00;
...                     ...            ...   ...                ...
18236            Grant Park       TRIANGLE    IL  12/31/2000 23:00;
18237           Spirit Lake           DISK    IA  12/31/2000 23:00;
18238           Eagle River            NaN    WI  12/31/2000 23:45;
18239           Eagle River          LIGHT    WI  12/31/2000 23:45;
18240                  Ybor           OVAL    FL  12/31/2000 23:59;

[18241 rows x 4 columns]

In [32]:
#pour la colonne 'Shape Reported', remplacer les valeurs manquantes par la
#valeur par défaut ‘VARIOUS’
data['Shape Reported'].fillna('VARIOUS',inplace=True)

In [33]:
data['Shape Reported'].isna().sum()

0

In [34]:
# repérer et supprimer les données dupliquées
data.duplicated().sum()

183

In [35]:
data=data.drop_duplicates()

In [36]:
data.duplicated().sum()

0

In [37]:
data.describe()

           City Shape Reported  State              Time;
count     18032          18058  18057              18057
unique     6441             27     52              16116
top     Seattle        VARIOUS     CA  11/16/1999 19:00;
freq        182           2949   2505                 27

In [38]:
#Renommer les colonnes 'Shape Reported', 'Colors Reported' respectivement en
#‘Forme’ et ‘Couleur’
data.rename(columns={'Shape Reported':'Forme'},inplace=True)

C:\Users\iBoy\anaconda3\lib\site-packages\pandas\core\frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [39]:
#Pratique 6 : réindexer les données selon l’ordre suivant : 'City', 'Forme',
#'Couleur','State','Time'.
colonnes=['City', 'Forme','State','Time;']
new_data=data[colonnes]

In [40]:
new_data.rename(columns={'Time;':'Time'},inplace=True)

In [41]:
new_data.Time=new_data.Time.str.replace(';',' ')

In [42]:
new_data.head()

                   City     Forme State              Time
0                Ithaca  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro     OTHER    NJ  6/30/1930 20:00
2               Holyoke      OVAL    CO  2/15/1931 14:00
3               Abilene      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair     LIGHT    NY  4/18/1933 19:00